In [2]:
%load_ext sql
%sql sqlite://

In [3]:
# Create tables & insert some random numbers
# Note: in Postgresql, try the generate_series function...
%sql DROP TABLE IF EXISTS R; DROP TABLE IF EXISTS S; DROP TABLE IF EXISTS T;
%sql CREATE TABLE R (A int); CREATE TABLE S (A int); CREATE TABLE T (A int);
for i in range(1,6):
    %sql INSERT INTO R VALUES (:i)
for i in range(1,10,2):
    %sql INSERT INTO S VALUES (:i)
for i in range(1,11,3):
    %sql INSERT INTO T VALUES (:i)

 * sqlite://
Done.
Done.
Done.
 * sqlite://
Done.
Done.
Done.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.

In [4]:
%%sql
drop table if exists product; -- This needs to be dropped if exists, see why further down!
drop table if exists company;
pragma foreign_keys = ON; -- WARNING by default off in sqlite
create table company (
    cname varchar primary key, -- company name uniquely identifies the company.
    stockprice money, -- stock price is in money 
    country varchar); -- country is just a string
insert into company values ('ToyWorks', 25.0, 'USA');
insert into company values ('ToyFriends', 65.0, 'China');
insert into company values ('ToyCo', 15.0, 'China');

create table product(
       pname varchar, -- name of the product
       price money, -- price of the product
       category varchar, -- category
       manufacturer varchar, -- manufacturer
       primary key (pname, manufacturer),
       foreign key (manufacturer) references company(cname));
insert into product values('Pikachu', 19.99, 'Toy', 'ToyWorks');
insert into product values('Pikachu', 19.99, 'Toy', 'ToyFriends');
insert into product values('Pokeball', 29.99, 'Electronic', 'ToyCo');
insert into product values('Bulbasaur', 149.99, 'Toy', 'ToyFriends');
insert into product values('Charizard', 203.99, 'Toy', 'ToyCo');
insert into product values('PokeCamera', 19.99, 'Electronic', 'ToyWorks');

 * sqlite://
Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

Activity 3:
-------------

Multi-table queries

Exercise #1
-----------

* Schema is same as before

> Product (<u>pname</u>,  price, category, manufacturer)<br>
> Company (<u>cname</u>, stockPrice, country)

* Our goal is to answer the following question:

> Find all categories of products that are made by Chinese companies

Write your query here:

In [7]:
%%sql
PRAGMA table_info(company);

 * sqlite://
Done.

[(0, 'cname', 'varchar', 0, None, 1),
 (1, 'stockprice', 'money', 0, None, 0),
 (2, 'country', 'varchar', 0, None, 0)]

In [12]:
%%sql
SELECT DISTINCT *
FROM product, company
WHERE company.country LIKE "%china%" and company.cname = product.manufacturer

 * sqlite://
Done.

[('Bulbasaur', 149.99, 'Toy', 'ToyFriends', 'ToyFriends', 65, 'China'),
 ('Charizard', 203.99, 'Toy', 'ToyCo', 'ToyCo', 15, 'China'),
 ('Pikachu', 19.99, 'Toy', 'ToyFriends', 'ToyFriends', 65, 'China'),
 ('Pokeball', 29.99, 'Electronic', 'ToyCo', 'ToyCo', 15, 'China')]

Exercise #2: An Unintuitive Query
-----------
For three tables $R,S,T$ that only have one attribute $A$:
* R = {1,2,3,4,5}
* S = {1,3,5,7,9}
* T = {1,4,7,10}
 
Can you write a query to select $R \cap (S \cup T)$- in other words elements that are in $R$ and either $S$ or $T$?

Write your query here:

Now test your query above for the case where $S = \emptyset$- what happens and why?

Execute the query below, then re-run your query above

In [4]:
%%sql
delete from S;

 * sqlite://
5 rows affected.

[]